<template>
  <div class="school-description">
    <h2>О нашей школе</h2>
    <p>Наша школа предлагает уникальные курсы испанского языка для различных целей и уровней подготовки. Мы гордимся нашими опытными преподавателями и индивидуальным подходом к каждому студенту.</p>
  </div>
</template>

<script>
export default {};
</script>

<style scoped>
.school-description {
  padding: 1rem; /* Добавляем отступы вокруг контейнера */
  max-width: 800px; /* Ограничиваем максимальную ширину */
  margin: 0 auto; /* Центрируем контейнер по горизонтали */
}

h2 {
  font-size: 2rem; /* Размер шрифта */
  margin-bottom: 1.5rem; /* Отступ снизу */
  color: #333; /* Цвет текста */
  text-align: center; /* Выравнивание текста по центру */
  font-weight: bold; /* Полужирное начертание */
  position: relative; /* Для позиционирования псевдо-элемента */
  padding: 10px 20px; /* Отступы внутри заголовка */
  border-bottom: 2px solid #4CAF50; /* Нижняя граница */
  background-color: #fff; /* Фон заголовка */
}

p {
  color: #555;
  font-size: 1rem; /* Размер шрифта для абзаца */
  line-height: 1.6; /* Высота строки для лучшей читаемости */
}

/* Медиа-запросы для мобильных устройств */
@media (max-width: 768px) {
  h2 {
    font-size: 1.5rem; /* Уменьшаем размер шрифта заголовка */
  }

  p {
    font-size: 0.9rem; /* Уменьшаем размер шрифта для абзаца */
  }
}
</style>
